virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMG55J19_DFP/component/mem2mem.h
/* -------- MEM2MEM_TCR : (MEM2MEM Offset: 0x10C) (R/W 32) Transmit Counter Register -------- */
#define MEM2MEM_TCR_TXCTR_Pos                 _U_(0)                                               /**< (MEM2MEM_TCR) Transmit Counter Register Position */
#define MEM2MEM_TCR_TXCTR_Msk                 (_U_(0xFFFF) << MEM2MEM_TCR_TXCTR_Pos)               /**< (MEM2MEM_TCR) Transmit Counter Register Mask */
#define MEM2MEM_TCR_TXCTR(value)              (MEM2MEM_TCR_TXCTR_Msk & ((value) << MEM2MEM_TCR_TXCTR_Pos))
#define MEM2MEM_TCR_Msk                       _U_(0x0000FFFF)                                      /**< (MEM2MEM_TCR) Register Mask  */


/* -------- MEM2MEM_RNPR : (MEM2MEM Offset: 0x110) (R/W 32) Receive Next Pointer Register -------- */
#define MEM2MEM_RNPR_RXNPTR_Pos               _U_(0)                                               /**< (MEM2MEM_RNPR) Receive Next Pointer Position */
#define MEM2MEM_RNPR_RXNPTR_Msk               (_U_(0xFFFFFFFF) << MEM2MEM_RNPR_RXNPTR_Pos)         /**< (MEM2MEM_RNPR) Receive Next Pointer Mask */
#define MEM2MEM_RNPR_RXNPTR(value)            (MEM2MEM_RNPR_RXNPTR_Msk & ((value) << MEM2MEM_RNPR_RXNPTR_Pos))
#define MEM2MEM_RNPR_Msk                      _U_(0xFFFFFFFF)                                      /**< (MEM2MEM_RNPR) Register Mask  */


/* -------- MEM2MEM_RNCR : (MEM2MEM Offset: 0x114) (R/W 32) Receive Next Counter Register -------- */
#define MEM2MEM_RNCR_RXNCTR_Pos               _U_(0)                                               /**< (MEM2MEM_RNCR) Receive Next Counter Position */
#define MEM2MEM_RNCR_RXNCTR_Msk               (_U_(0xFFFF) << MEM2MEM_RNCR_RXNCTR_Pos)             /**< (MEM2MEM_RNCR) Receive Next Counter Mask */
#define MEM2MEM_RNCR_RXNCTR(value)            (MEM2MEM_RNCR_RXNCTR_Msk & ((value) << MEM2MEM_RNCR_RXNCTR_Pos))
#define MEM2MEM_RNCR_Msk                      _U_(0x0000FFFF)                                      /**< (MEM2MEM_RNCR) Register Mask  */


/* -------- MEM2MEM_TNPR : (MEM2MEM Offset: 0x118) (R/W 32) Transmit Next Pointer Register -------- */
#define MEM2MEM_TNPR_TXNPTR_Pos               _U_(0)                                               /**< (MEM2MEM_TNPR) Transmit Next Pointer Position */
#define MEM2MEM_TNPR_TXNPTR_Msk               (_U_(0xFFFFFFFF) << MEM2MEM_TNPR_TXNPTR_Pos)         /**< (MEM2MEM_TNPR) Transmit Next Pointer Mask */
#define MEM2MEM_TNPR_TXNPTR(value)            (MEM2MEM_TNPR_TXNPTR_Msk & ((value) << MEM2MEM_TNPR_TXNPTR_Pos))
#define MEM2MEM_TNPR_Msk                      _U_(0xFFFFFFFF)                                      /**< (MEM2MEM_TNPR) Register Mask  */


/* -------- MEM2MEM_TNCR : (MEM2MEM Offset: 0x11C) (R/W 32) Transmit Next Counter Register -------- */
#define MEM2MEM_TNCR_TXNCTR_Pos               _U_(0)                                               /**< (MEM2MEM_TNCR) Transmit Counter Next Position */
#define MEM2MEM_TNCR_TXNCTR_Msk               (_U_(0xFFFF) << MEM2MEM_TNCR_TXNCTR_Pos)             /**< (MEM2MEM_TNCR) Transmit Counter Next Mask */
#define MEM2MEM_TNCR_TXNCTR(value)            (MEM2MEM_TNCR_TXNCTR_Msk & ((value) << MEM2MEM_TNCR_TXNCTR_Pos))
#define MEM2MEM_TNCR_Msk                      _U_(0x0000FFFF)                                      /**< (MEM2MEM_TNCR) Register Mask  */


/* -------- MEM2MEM_PTCR : (MEM2MEM Offset: 0x120) ( /W 32) Transfer Control Register -------- */
#define MEM2MEM_PTCR_RXTEN_Pos                _U_(0)                                               /**< (MEM2MEM_PTCR) Receiver Transfer Enable Position */
#define MEM2MEM_PTCR_RXTEN_Msk                (_U_(0x1) << MEM2MEM_PTCR_RXTEN_Pos)                 /**< (MEM2MEM_PTCR) Receiver Transfer Enable Mask */
#define MEM2MEM_PTCR_RXTEN(value)             (MEM2MEM_PTCR_RXTEN_Msk & ((value) << MEM2MEM_PTCR_RXTEN_Pos))
#define MEM2MEM_PTCR_RXTDIS_Pos               _U_(1)                                               /**< (MEM2MEM_PTCR) Receiver Transfer Disable Position */
#define MEM2MEM_PTCR_RXTDIS_Msk               (_U_(0x1) << MEM2MEM_PTCR_RXTDIS_Pos)                /**< (MEM2MEM_PTCR) Receiver Transfer Disable Mask */
#define MEM2MEM_PTCR_RXTDIS(value)            (MEM2MEM_PTCR_RXTDIS_Msk & ((value) << MEM2MEM_PTCR_RXTDIS_Pos))
#define MEM2MEM_PTCR_TXTEN_Pos                _U_(8)                                               /**< (MEM2MEM_PTCR) Transmitter Transfer Enable Position */
#define MEM2MEM_PTCR_TXTEN_Msk                (_U_(0x1) << MEM2MEM_PTCR_TXTEN_Pos)                 /**< (MEM2MEM_PTCR) Transmitter Transfer Enable Mask */
#define MEM2MEM_PTCR_TXTEN(value)             (MEM2MEM_PTCR_TXTEN_Msk & ((value) << MEM2MEM_PTCR_TXTEN_Pos))
#define MEM2MEM_PTCR_TXTDIS_Pos               _U_(9)                                               /**< (MEM2MEM_PTCR) Transmitter Transfer Disable Position */
#define MEM2MEM_PTCR_TXTDIS_Msk               (_U_(0x1) << MEM2MEM_PTCR_TXTDIS_Pos)                /**< (MEM2MEM_PTCR) Transmitter Transfer Disable Mask */
#define MEM2MEM_PTCR_TXTDIS(value)            (MEM2MEM_PTCR_TXTDIS_Msk & ((value) << MEM2MEM_PTCR_TXTDIS_Pos))
#define MEM2MEM_PTCR_RXCBEN_Pos               _U_(16)                                              /**< (MEM2MEM_PTCR) Receiver Circular Buffer Enable Position */
#define MEM2MEM_PTCR_RXCBEN_Msk               (_U_(0x1) << MEM2MEM_PTCR_RXCBEN_Pos)                /**< (MEM2MEM_PTCR) Receiver Circular Buffer Enable Mask */
#define MEM2MEM_PTCR_RXCBEN(value)            (MEM2MEM_PTCR_RXCBEN_Msk & ((value) << MEM2MEM_PTCR_RXCBEN_Pos))
#define MEM2MEM_PTCR_RXCBDIS_Pos              _U_(17)                                              /**< (MEM2MEM_PTCR) Receiver Circular Buffer Disable Position */
#define MEM2MEM_PTCR_RXCBDIS_Msk              (_U_(0x1) << MEM2MEM_PTCR_RXCBDIS_Pos)               /**< (MEM2MEM_PTCR) Receiver Circular Buffer Disable Mask */
#define MEM2MEM_PTCR_RXCBDIS(value)           (MEM2MEM_PTCR_RXCBDIS_Msk & ((value) << MEM2MEM_PTCR_RXCBDIS_Pos))
#define MEM2MEM_PTCR_TXCBEN_Pos               _U_(18)                                              /**< (MEM2MEM_PTCR) Transmitter Circular Buffer Enable Position */
#define MEM2MEM_PTCR_TXCBEN_Msk               (_U_(0x1) << MEM2MEM_PTCR_TXCBEN_Pos)                /**< (MEM2MEM_PTCR) Transmitter Circular Buffer Enable Mask */
#define MEM2MEM_PTCR_TXCBEN(value)            (MEM2MEM_PTCR_TXCBEN_Msk & ((value) << MEM2MEM_PTCR_TXCBEN_Pos))
#define MEM2MEM_PTCR_TXCBDIS_Pos              _U_(19)                                              /**< (MEM2MEM_PTCR) Transmitter Circular Buffer Disable Position */
#define MEM2MEM_PTCR_TXCBDIS_Msk              (_U_(0x1) << MEM2MEM_PTCR_TXCBDIS_Pos)               /**< (MEM2MEM_PTCR) Transmitter Circular Buffer Disable Mask */
#define MEM2MEM_PTCR_TXCBDIS(value)           (MEM2MEM_PTCR_TXCBDIS_Msk & ((value) << MEM2MEM_PTCR_TXCBDIS_Pos))
#define MEM2MEM_PTCR_ERRCLR_Pos               _U_(24)                                              /**< (MEM2MEM_PTCR) Transfer Bus Error Clear Position */
#define MEM2MEM_PTCR_ERRCLR_Msk               (_U_(0x1) << MEM2MEM_PTCR_ERRCLR_Pos)                /**< (MEM2MEM_PTCR) Transfer Bus Error Clear Mask */
#define MEM2MEM_PTCR_ERRCLR(value)            (MEM2MEM_PTCR_ERRCLR_Msk & ((value) << MEM2MEM_PTCR_ERRCLR_Pos))
#define MEM2MEM_PTCR_Msk                      _U_(0x010F0303)                                      /**< (MEM2MEM_PTCR) Register Mask  */


