virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMG55J19_DFP/component/mem2mem.h
/* -------- MEM2MEM_PTSR : (MEM2MEM Offset: 0x124) ( R/ 32) Transfer Status Register -------- */
#define MEM2MEM_PTSR_RXTEN_Pos                _U_(0)                                               /**< (MEM2MEM_PTSR) Receiver Transfer Enable Position */
#define MEM2MEM_PTSR_RXTEN_Msk                (_U_(0x1) << MEM2MEM_PTSR_RXTEN_Pos)                 /**< (MEM2MEM_PTSR) Receiver Transfer Enable Mask */
#define MEM2MEM_PTSR_RXTEN(value)             (MEM2MEM_PTSR_RXTEN_Msk & ((value) << MEM2MEM_PTSR_RXTEN_Pos))
#define MEM2MEM_PTSR_TXTEN_Pos                _U_(8)                                               /**< (MEM2MEM_PTSR) Transmitter Transfer Enable Position */
#define MEM2MEM_PTSR_TXTEN_Msk                (_U_(0x1) << MEM2MEM_PTSR_TXTEN_Pos)                 /**< (MEM2MEM_PTSR) Transmitter Transfer Enable Mask */
#define MEM2MEM_PTSR_TXTEN(value)             (MEM2MEM_PTSR_TXTEN_Msk & ((value) << MEM2MEM_PTSR_TXTEN_Pos))
#define MEM2MEM_PTSR_RXCBEN_Pos               _U_(16)                                              /**< (MEM2MEM_PTSR) Receiver Circular Buffer Enable Position */
#define MEM2MEM_PTSR_RXCBEN_Msk               (_U_(0x1) << MEM2MEM_PTSR_RXCBEN_Pos)                /**< (MEM2MEM_PTSR) Receiver Circular Buffer Enable Mask */
#define MEM2MEM_PTSR_RXCBEN(value)            (MEM2MEM_PTSR_RXCBEN_Msk & ((value) << MEM2MEM_PTSR_RXCBEN_Pos))
#define MEM2MEM_PTSR_TXCBEN_Pos               _U_(18)                                              /**< (MEM2MEM_PTSR) Transmitter Circular Buffer Enable Position */
#define MEM2MEM_PTSR_TXCBEN_Msk               (_U_(0x1) << MEM2MEM_PTSR_TXCBEN_Pos)                /**< (MEM2MEM_PTSR) Transmitter Circular Buffer Enable Mask */
#define MEM2MEM_PTSR_TXCBEN(value)            (MEM2MEM_PTSR_TXCBEN_Msk & ((value) << MEM2MEM_PTSR_TXCBEN_Pos))
#define MEM2MEM_PTSR_ERR_Pos                  _U_(24)                                              /**< (MEM2MEM_PTSR) Transfer Bus Error Position */
#define MEM2MEM_PTSR_ERR_Msk                  (_U_(0x1) << MEM2MEM_PTSR_ERR_Pos)                   /**< (MEM2MEM_PTSR) Transfer Bus Error Mask */
#define MEM2MEM_PTSR_ERR(value)               (MEM2MEM_PTSR_ERR_Msk & ((value) << MEM2MEM_PTSR_ERR_Pos))
#define MEM2MEM_PTSR_Msk                      _U_(0x01050101)                                      /**< (MEM2MEM_PTSR) Register Mask  */


/** \brief MEM2MEM register offsets definitions */
#define MEM2MEM_THR_REG_OFST           (0x00)              /**< (MEM2MEM_THR) Memory to Memory Transfer Holding Register Offset */
#define MEM2MEM_MR_REG_OFST            (0x04)              /**< (MEM2MEM_MR) Memory to Memory Mode Register Offset */
#define MEM2MEM_IER_REG_OFST           (0x08)              /**< (MEM2MEM_IER) Memory to Memory Interrupt Enable Register Offset */
#define MEM2MEM_IDR_REG_OFST           (0x0C)              /**< (MEM2MEM_IDR) Memory to Memory Interrupt Disable Register Offset */
#define MEM2MEM_IMR_REG_OFST           (0x10)              /**< (MEM2MEM_IMR) Memory to Memory Interrupt Mask Register Offset */
#define MEM2MEM_ISR_REG_OFST           (0x14)              /**< (MEM2MEM_ISR) Memory to Memory Interrupt Status Register Offset */
#define MEM2MEM_RPR_REG_OFST           (0x100)             /**< (MEM2MEM_RPR) Receive Pointer Register Offset */
#define MEM2MEM_RCR_REG_OFST           (0x104)             /**< (MEM2MEM_RCR) Receive Counter Register Offset */
#define MEM2MEM_TPR_REG_OFST           (0x108)             /**< (MEM2MEM_TPR) Transmit Pointer Register Offset */
#define MEM2MEM_TCR_REG_OFST           (0x10C)             /**< (MEM2MEM_TCR) Transmit Counter Register Offset */
#define MEM2MEM_RNPR_REG_OFST          (0x110)             /**< (MEM2MEM_RNPR) Receive Next Pointer Register Offset */
#define MEM2MEM_RNCR_REG_OFST          (0x114)             /**< (MEM2MEM_RNCR) Receive Next Counter Register Offset */
#define MEM2MEM_TNPR_REG_OFST          (0x118)             /**< (MEM2MEM_TNPR) Transmit Next Pointer Register Offset */
#define MEM2MEM_TNCR_REG_OFST          (0x11C)             /**< (MEM2MEM_TNCR) Transmit Next Counter Register Offset */
#define MEM2MEM_PTCR_REG_OFST          (0x120)             /**< (MEM2MEM_PTCR) Transfer Control Register Offset */
#define MEM2MEM_PTSR_REG_OFST          (0x124)             /**< (MEM2MEM_PTSR) Transfer Status Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief MEM2MEM register API structure */
typedef struct
{
  __IO  uint32_t                       MEM2MEM_THR;        /**< Offset: 0x00 (R/W  32) Memory to Memory Transfer Holding Register */
  __IO  uint32_t                       MEM2MEM_MR;         /**< Offset: 0x04 (R/W  32) Memory to Memory Mode Register */
  __O   uint32_t                       MEM2MEM_IER;        /**< Offset: 0x08 ( /W  32) Memory to Memory Interrupt Enable Register */
  __O   uint32_t                       MEM2MEM_IDR;        /**< Offset: 0x0C ( /W  32) Memory to Memory Interrupt Disable Register */
  __I   uint32_t                       MEM2MEM_IMR;        /**< Offset: 0x10 (R/   32) Memory to Memory Interrupt Mask Register */
  __I   uint32_t                       MEM2MEM_ISR;        /**< Offset: 0x14 (R/   32) Memory to Memory Interrupt Status Register */
  __I   uint8_t                        Reserved1[0xE8];
  __IO  uint32_t                       MEM2MEM_RPR;        /**< Offset: 0x100 (R/W  32) Receive Pointer Register */
  __IO  uint32_t                       MEM2MEM_RCR;        /**< Offset: 0x104 (R/W  32) Receive Counter Register */
  __IO  uint32_t                       MEM2MEM_TPR;        /**< Offset: 0x108 (R/W  32) Transmit Pointer Register */
  __IO  uint32_t                       MEM2MEM_TCR;        /**< Offset: 0x10C (R/W  32) Transmit Counter Register */
  __IO  uint32_t                       MEM2MEM_RNPR;       /**< Offset: 0x110 (R/W  32) Receive Next Pointer Register */
  __IO  uint32_t                       MEM2MEM_RNCR;       /**< Offset: 0x114 (R/W  32) Receive Next Counter Register */
  __IO  uint32_t                       MEM2MEM_TNPR;       /**< Offset: 0x118 (R/W  32) Transmit Next Pointer Register */
  __IO  uint32_t                       MEM2MEM_TNCR;       /**< Offset: 0x11C (R/W  32) Transmit Next Counter Register */
  __O   uint32_t                       MEM2MEM_PTCR;       /**< Offset: 0x120 ( /W  32) Transfer Control Register */
  __I   uint32_t                       MEM2MEM_PTSR;       /**< Offset: 0x124 (R/   32) Transfer Status Register */
} mem2mem_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMG55_MEM2MEM_COMPONENT_H_ */
